{"datetime":1553682998800,"toplist":[{"expires_at":"2019-05-11T11:36:24","created_at":"2019-01-11T21:36:36","proposal_json":"{\"content\":\"Take the currently locked tokens reserved for the Work Proposal System and spread them out to all users based on their holdings 30 days after acceptance of this proposal. Users would get a percentage of those tokens based on the percentage they have of the total EOS in circulation.\",\"type\":\"referendum-v1\"}","title":"Spread out WPS tokens evenly to everyone.","proposer":"scatterhwtst","proposal_name":"fundeveryone"},{"expires_at":"2019-05-08T16:32:00","created_at":"2019-02-07T22:49:55","proposal_json":"{\"content\":\"# Question:\\n\\n \\n\\nShould EOS adopt the EOS User Agreement (EUA) in place of the interim Constitution?\\n\\n \\n\\n# Preamble:\\n\\nThe EOS User Agreement (EUA) is a template primarily authored by top 21 Block Producer EOS New York. The EUA was written to replace the interim constitution. The interim constitution is in many places vague, largely unenforceable, and has been a source of conflict within the community. The EOS User Agreement is being proposed in order to establish a governing document that is manageable, reasonable, and enforceable and that serves as a reflection of the way the EOS Mainnet currently functions at a protocol level.\\n\\n \\n\\n# Result if enacted:\\n\\n \\n\\nThe EOS User Agreement will act as the foundational document of the EOS blockchain and will establish the expectations of EOS governance amongst all user types. The EUA will serve as a written reflection of the method of governance that the EOS Mainnet already employs, delegated-proof-of-stake. The interim Constitution will be removed as a governing document in its entirety.\\n\\n \\n\\n# Result if rejected:\\n\\n \\n\\nThe interim constitution remains.\\n\\n \\n\\n# Major Effect of Amendment Proposal:\\n\\n \\n\\nCurrently, token-holders may, without permission, vote for any number of block producers (up to 30) at any time and for any reason. Block Producers, exercising the authority delegated to them by EOS stakeholders, provide infrastructure to produce blocks and participate in the maintenance and optimization of the EOS protocol via multi-signature approval transactions. The EUA encapsulates this process in detail. The only major effect is that the expectation of what constitutes “governance” on the EOS Mainnet will become something manageable, reasonable, and enforceable and be supported by a framework for agile iteration and development.\\n\\n \\n\\n# Key Expectation Set\\n\\n \\n\\nBlock Producers may never bypass valid permission checks on the blockchain to affect any EOS user account in any situation other than where the normal operation and function of the EOS Mainnet is threatened.  \\n\\n \\n\\n___\\n\\n \\n\\n__Amendment Proposal Language:__\\n\\n# The EOS User Agreement\\n\\n \\n\\n## Definitions\\n\\n \\n\\n All capitalized, italicized, or inline code terms in *The EOS User Agreement* will be given the same effect and meaning as in *Definitions*.\\n\\n \\n\\n* EOS User Agreement: This document (*EUA*)\\n\\n \\n\\n* Chain ID: `chain_id` - aca376f206b8fc25a6ed44dbdc66547c36c6c33e3a119ffbeaef943642f0e906\\n\\n \\n\\n* User: Any person or organization of persons who maintain(s) direct or indirect ownership of an EOS account, or EOS-based property connected to an EOS account.\\n\\n \\n\\n* Ownership: Direct or indirect access to an EOS account through one or more valid permissions checks. Ownership may be partially shared between Users through the use of multi-signature permissions.\\n\\n \\n\\n* Block Producer: Users who have called `regproducer` and receive rewards from eosio.vpay.\\n\\n \\n\\n* `eosio.prods`: An EOS account with a dynamic permissions structure that can assume the privileges of the `eosio` account when 15/21 Block Producers agree to do so.\\n\\n \\n\\n* Network Funds: Tokens contained within the following accounts: `eosio.names`, `eosio.ramfee`, `eosio.saving`.\\n\\n \\n\\n* Governing Documents: *regproducer* is considered a governing document.\\n\\n \\n\\n* On-Chain: Any transaction, smart contract, or Ricardian contract which is located within a block that is irreversible and appended to the EOS blockchain `chain_id`.\\n\\n \\n\\n* EOS-based Property: Anything that requires a valid permission in order to directly manipulate, alter, transfer, influence, or otherwise effect on the EOS Blockchain\\n\\n \\n\\n* Call: To submit an action to the EOS Blockchain `chain_id`.\\n\\n \\n\\n* Authorizations & Permissions: Permissions are arbitrary names used to define the requirements for a transaction sent on behalf of that permission. Permissions can be assigned for authority over specific contract actions.\\n\\n \\n\\n* Ricardian Contract: A contract that places the defining elements of a legal agreement in a format that can be expressed and executed in software.\\n\\n \\n\\n# Article I -  User Acknowledgement of Risks\\n\\nIf User loses access to their EOS account on `chain_id` and has not taken appropriate measures to secure access to their EOS account by other means, the User acknowledges and agrees that that EOS account will become inaccessible. Users acknowledge that the User has an adequate understanding of the risks, usage and intricacies of cryptographic tokens and blockchain-based software. The User acknowledges and agrees that the User is using the EOS blockchain at their sole risk.\\n\\n \\n\\n# Article II - Special User Types\\n\\nUsers who call `regproducer` agree to, and are bound by, the *regproducer* Ricardian Contract.\\n\\n \\n\\n# Article III - Consent of the EUA\\n\\nThe nature of the *EOS User Agreement* is such that it serves as a description of the current EOS Mainnet governance functions that are in place. These functions, enforced by code, do not require the consent of Users as these functions are inherent and systemic to the EOS Mainnet itself.\\n\\n \\n\\n# Article IV - Governing Documents\\n\\nAny modifications to the *EUA* and *governing documents* may be made by `eosio.prods`. It is admonished that a statement be crafted and issued through `eosio.prods` via eosio.forum referendum contract describing such a modification in advance.\\n\\n \\n\\n# Article V - Native Unit of Value\\n\\nThe native unit of value on EOS chain_id shall be the EOS token as defined and created by the `eosio.token` smart contract.\\n\\n \\n\\n# Article VI - Maintaining the EOS blockchain\\n\\n`eosio.prods` will maintain the active blockchain codebase which includes, but is not limited to, the implementation of all modifications of all features, optimizations, and upgrades: present and future.\\n\\n \\n\\n# Article VII - Network Funds\\n\\nIt is admonished that any altering of the state of any tokens contained within network fund accounts, or altering any pre-existing code that directly or indirectly governs the allocation, fulfillment, or distribution of any *network funds* be preceded by a statement crafted and issued by `eosio.prods` to the *eosio.forum* referendum system contract describing the effect in advance.\\n\\n \\n\\n# Article VIII - Freedom of Account Creation\\n\\nAny current or future User is able to create an EOS Account without the permission by any other User. `eosio.prods` may never affect an EOS User Account(s) without valid permission(s) which have been shared with `eosio.prods` by an EOS account. `eosio.prods` may charge a fee for any actions that are requested by other Users pertaining to an EOS account where permissions are shared.\\n\\n \\n\\n# Article IX - No Fiduciary\\n\\nNo User shall have a fiduciary purpose to support the value of the EOS token. No User can authorize anyone to hold assets, borrow, speak, contract on behalf of other EOS Users or the EOS blockchain `chain_id` collectively. This EOS blockchain shall have no owners, managers, or fiduciaries.\\n\\n \\n\\n# Article X - User Security\\n\\nAll items pertaining to personal account security, including but not limited to the safekeeping of private keys, is solely the responsibility of the User to secure.\\n\\n \\n\\n# Article XI - `eosio.prods` Limited Liability\\n\\nThe User acknowledges and agrees that, to the fullest extent permitted by any applicable law, this disclaimer of liability applies to any and all damages or injury whatsoever caused by or related to risks of, use of, or inability to use, the EOS token or the EOS blockchain `chain_id` under any cause of action whatsoever of any kind in any jurisdiction, including, without limitation, actions for breach of warranty, breach of contract or tort (including negligence) and that `eosio.prods`, nor the individual permissions that operate it, shall not be liable for any indirect, incidental, special, exemplary or consequential damages, including for loss of profits, goodwill or data.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n___\\n\\n \\n\\n \\n\\n# Does this Amendment Proposal require a code update?  If so, provide proposed change:\\n\\n \\n\\nThe EUA language will be injected into the eosio.system.abi under “id”: EOS User Agreement and “body”:\\n\\n \\n\\nRemove all language from: https://github.com/EOS-Mainnet/governance/blob/master/eosio.system/eosio.system.abi#L1169\\n\\n \\n\\nAdd EUA language to:\\n\\nhttps://github.com/EOS-Mainnet/governance/blob/master/eosio.system/eosio.system.ab\",\"type\":\"referendum-v1\"}","title":"Should EOS adopt the EOS User Agreement (EUA) in place of the interim Constitution?","proposer":"eosuseragree","proposal_name":"eosuseragree"},{"expires_at":"2019-05-12T03:11:11","created_at":"2019-01-11T18:11:16","proposal_json":"{\"content\":\"The exchanges are divided into supporting and not doing user voting. \\nThe exchange that does not support voting uses the user's right to vote.\\nDon't give voting rights to exchanges that don't support voting for users.\\n\\n거래소는 유저 투표를 지원하는 곳과 하지 않는 곳으로 나뉩니다.\\n투표를 지원하지 않는 거래소는 유저의 투표권을 마음대로 사용합니다.\\n유저의 투표를 지원하지 않는 거래소에는 투표권을 주지 말았으면 합니다.\\n\\n取引所はユーザ投票を支援する所としないところとに分かれる。 \\n投票を支援しない取引所はユーザの投票権を自由に使っている\\nユーザーの投票を支援しない取引所には投票権を与えない。\\n取引所が投票ツールを開発するように誘導しよう\\n\\n交易所分为支持用户投票的地方和不投票的地方。 \\n不支持投票的交易所随意使用用户投票权。\\n不要给不支持用户投票的交易所投票权。\\n引导交易所开发投票工具\",\"type\":\"referendum-v1\"}","title":"Let's get the exchange to develop a voting tool (거래소에서 투표툴을 개발하도록 유도합시다)","proposer":"koreapartner","proposal_name":"kiliman"},{"expires_at":"2019-02-28T00:00:00","created_at":"2019-01-11T19:25:16","proposal_json":"{\"content\":\"with eos token price that low and cost of producer that high is not easy to run a node with good infrastructure\\n\\nlets concentrate the rewards and help the large BPs to get more rewards reducing the amount of paid BPs\",\"type\":\"simple\"}","title":"Reduce the number of BPs to 10 and paid SP to 5","proposer":"sanfenafrica","proposal_name":"geteos"},{"expires_at":"2019-05-11T07:18:30","created_at":"2019-01-11T18:18:48","proposal_json":"{\"content\":\"Would EOS be better off if ECAF would not be able to issue key switching orders and we would rather rely on the code and block producers 15 out of 21 multisig?\",\"type\":\"referendum-v1\"}","title":"Delete Eos Core Arbitration Forum ?","proposer":"freeos4decaf","proposal_name":"decaf"},{"expires_at":"2019-05-12T00:00:00","created_at":"2019-01-12T13:53:39","proposal_json":"{\"type\":\"referendum-v1\",\"question\":\"Should EOS tokens sent to eosio.ramfee and eosio.names accounts in the future be allocated to REX?\",\"content\":\"## Question\\nShould future EOS tokens sent to eosio.ramfee and eosio.names accounts be allocated to REX? \\n## Method\\nTo do this, the Block Producers will have to set CHANNEL_RAM_AND_NAMEBID_FEES_TO_REX = 1 (https://github.com/EOSIO/eosio.contracts/blob/44d53447e04cb9fc32e1a73aacb7119511363a29/contracts/eosio.system/include/eosio.system/eosio.system.hpp#L23) \\n## Background Information\\nThe EOS Resource Exchange (REX) enables token holders to lend/borrow CPU and NET resources. \\nOne of the features of REX is that it can also distribute EOS fees paid into system accounts, eosio.ramfee and eosio.names, on top of the fees paid by those borrowing the resources. \\n\\n* eosio.ramfee account: This account holds the 0.5% fee paid for all RAM purchases and sales on EOS.\\n* eosio.names account: This account holds all EOS paid for short names (e.g. \\\".eos\\\") each day in the shortname auction\\n\\nOriginal Announcement of REX from Dan Larimer: https://medium.com/@bytemaster/proposal-for-eos-resource-renting-rent-distribution-9afe8fb3883a\\n\\n## Additional notes\\nThe addition of these funds would not increase inflation nor effect the 4% inflation allocated to the eosio.saving. The current funds in both accounts in question would not be touched, only future tokens that enter the accounts would be reallocated into REX.\\n\\n\\n<!--lang:zh-->\\n##问题\\n以后进入eosio.ramfee和eosio.names账户的EOS 代币，是否应当被分配给REX（EOS资源交易所）？\\n\\n##方法\\n要做到这一点，节点们需设置CHANNEL_RAM_AND_NAMEBID_FEES_TO_REX = 1 (https://github.com/EOSIO/eosio.contracts/blob/44d53447e04cb9fc32e1a73aacb7119511363a29/contracts/eosio.system/include/eosio.system/eosio.system.hpp#L23)\\n\\n##背景信息\\nEOS资源交易所（REX）可实现代币持有者借出/借入CPU和网络资源。\\nREX的一个特点是，除了借入资源方支付的费用外，它还可以分配支付到系统账户eosio.ramfee和eosio.names中的EOS费用。\\n\\n* eosio.ramfee账户：此账户会存入在EOS上所有用于购买和售出RAM所支付费用的0.5%。\\n* eosio.names账户：此账户会存入每天在短域名拍卖（shortname auction）中用于获得短域名（例如：\\\".eos\\\"）所支付的所有EOS。\\n\\nDan Larimer关于REX的最初声明：https://medium.com/@bytemaster/proposal-for-eos-resource-renting-rent-distribution-9afe8fb3883a\\n\\n##补充说明\\n这些资金的增加不会增加通货膨胀，也不会影响到分配给eosio.saving账户的4%。这两个账户中目前的资金都不会被触及，只有以后进入账户的代币才会被重新分配到REX中。\\n\\n\\n<!--lang:ko-->\\n## 질문\\n미래 eosio.ramfee와 eosio.names 시스템 어카운트 수익금을 REX 참여자에게 분배해야 할까요?\\n\\n## 방법\\n이 안을 적용하기 위해서는 BP들이 \\\"CHANNEL_RAM_AND_NAMEBID_FEES_TO_REX\\\" 설정값을 \\\"1\\\" 로 설정해야 합니다. (https://github.com/EOSIO/eosio.contracts/blob/44d53447e04cb9fc32e1a73aacb7119511363a29/contracts/eosio.system/include/eosio.system/eosio.system.hpp#L23) \\n\\n## 배경\\nEOS 자원거래소(REX;Resource EXchange)는 EOS 토큰 홀더들이 CPU와 NET 자원을 임대/임차할 수 있도록 해주는 시스템입니다.\\nREX가 가진 또 하나의 특징은 리소스를 빌려가는 사람의 수수료 뿐만 아니라 eosio.ramfee와 eosio.names에 축적된 RAM 거래 및 어카운트명 경매 수익금도 참여자에게 배분할 수 있다는 점입니다.\\n\\n* eosio.ramfee 시스템 어카운트: 사용자들의 RAM 거래간 발생한 0.5% 수수료 수익을 보관하고 있습니다.\\n* eosio.names 어카운트: 짧은 어카운트명(예시: \\\".eos\\\") 경매를 통해 시스템이 거둬들인 일단위 수익을 보관하고 있습니다.\\n\\nREX에 대한 댄 래리머의 공지 원문은 여기에서 확인하실 수 있습니다: https://medium.com/@bytemaster/\\n\\n## 추가 논의\\nRAM 수익 및 계정명 경매 수익을 REX에 추가하는 것을 다루는 본 제안은 eosio.saving 시스템 어카운트에 축적되고있는 4% 인플레이션에는 아무런 영향을 끼치지 않습니다. 본 제안은 앞으로 발생할 RAM 거래 수수료 수익 및 어카운트명 경매 수익금만을 다루며, 지금 시점까지 거두어들인 금액에 대해서는 소급적용하지 않습니다.\"}","title":"Should EOS tokens sent to eosio.ramfee and eosio.names accounts in the future be allocated to REX?","proposer":"eosreferenda","proposal_name":"rex4all"}]}